Repository: adriaan-code/koma_schedules
Catalog: lib/l10n/app_*.arb
Languages: pl, uk

# appTitle
source: KOMA App
pl: Aplikacja KOMA
uk: Додаток KOMA

# komaServices
source: KOMA MUNICIPAL SERVICES
pl: KOMA USŁUGI KOMUNALNE
uk: KOMA КОМУНАЛЬНІ ПОСЛУГИ

source: BACK
pl: POWRÓT
uk: НАЗАД

# returnButton
source: RETURN
pl: POWRÓT
uk: НАЗАД

source: Cancel
pl: Anuluj
uk: Скасувати

source: Search
pl: Szukaj
uk: Пошук

source: Loading...
pl: Ładowanie...
uk: Завантаження...

source: Error
pl: Błąd
uk: Помилка

source: No data
pl: Brak danych
uk: Немає даних

source: Try again
pl: Spróbuj ponownie
uk: Спробуйте знову

source: Schedule
pl: Harmonogram
uk: Розклад

source: Knowledge Base
pl: Baza wiedzy
uk: База знань

# shop
source: KOMA Shop
pl: Sklep KOMA
uk: Магазин KOMA

source: BOK Portal
uk: BOK Портал

source: Notifications
pl: Powiadomienia
uk: Сповіщення

source: Settings
pl: Ustawienia
uk: Налаштування

source: Notifications - coming soon
pl: Powiadomienia - wkrótce dostępne
uk: Сповіщення - скоро доступні

source: Address Search
pl: Wyszukiwanie adresu
uk: Пошук адреси

# searchAddress
source: SEARCH
pl: WYSZUKAJ
uk: ШУКАТИ

source: ADDRESS
pl: ADRES
uk: АДРЕСА

source: Use location
pl: Użyj lokalizacji
uk: Використати локацію

source: Getting location...
pl: Pobieranie lokalizacji...
uk: Отримання локації...

source: Location Error
pl: Błąd lokalizacji
uk: Помилка локації

source: GPS Location
pl: Lokalizacja GPS
uk: GPS локація

source: Coordinates
pl: Współrzędne
uk: Координати

source: Select sector
pl: Wybierz sektor
uk: Виберіть сектор

source: Select prefix
pl: Wybierz prefiks
uk: Виберіть префікс

source: Select locality
pl: Wybierz miejscowość
uk: Виберіть населений пункт

source: Select city
pl: Wybierz miasto
uk: Виберіть місто

source: Select street
pl: Wybierz ulicę
uk: Виберіть вулицю

source: Select property
pl: Wybierz posesję
uk: Виберіть нерухомість

source: Select property number
pl: Wybierz numer posesji
uk: Виберіть номер будинку

# noProperties
source: No properties - check logs
pl: Brak posesji - sprawdź logi
uk: Немає нерухомості - перевірте журнали

source: SHOW SCHEDULE
pl: POKAŻ HARMONOGRAM
uk: ПОКАЗАТИ РОЗКЛАД

source: Loading sectors...
pl: Ładowanie sektorów...
uk: Завантаження секторів...

# loadingSectorsError
source: Error loading sectors
pl: Błąd ładowania sektorów
uk: Помилка завантаження секторів

source: Select sector and locality
pl: Wybierz sektor i miejscowość
uk: Виберіть сектор та населений пункт

# toFindSchedule
source: To find the schedule, select an address from the list below or use manual search.
pl: Aby znaleźć harmonogram, wybierz adres z listy poniżej lub użyj wyszukiwania ręcznego.
uk: Щоб знайти розклад, виберіть адресу зі списку нижче або використовуйте ручний пошук.

source: Favorite locations
pl: Ulubione lokalizacje
uk: Улюблені локації

source: Recent locations
pl: Ostatnie lokalizacje
uk: Останні локації

source: Recent searches
pl: Ostatnie wyszukiwania
uk: Останні пошуки

source: Added to favorites
pl: Dodano do ulubionych
uk: Додано до улюблених

source: Removed from favorites
pl: Usunięto z ulubionych
uk: Видалено з улюблених

# orSelectNewLocation
source: Or select a new location using the dropdowns above
pl: Lub wybierz nową lokalizację używając list rozwijanych powyżej
uk: Або виберіть нову локацію, використовуючи списки вище

source: Waste Schedule
pl: Harmonogram odpadów
uk: Розклад відходів

source: Waste collection
pl: Odbiór odpadów
uk: Вивезення відходів

source: Today
pl: Dzisiaj
uk: Сьогодні

source: Tomorrow
pl: Jutro
uk: Завтра

source: Next week
pl: W przyszłym tygodniu
uk: Наступного тижня

source: Waste today
pl: Odpady na dzisiaj
uk: Відходи сьогодні

# todayCollection
source: Today's collection:
pl: Dzisiaj odbiera się:
uk: Сьогодні вивозять:

source: Waste type
pl: Typ odpadu
uk: Тип відходів

source: Collection time
pl: Czas odbioru
uk: Час вивезення

source: Container
pl: Pojemnik
uk: Контейнер

source: Frequency
pl: Częstotliwość
uk: Частота

source: Waste Database
pl: Baza Odpadów
uk: База відходів

# searchWaste
source: SEARCH
pl: WYSZUKAJ
uk: ШУКАТИ

source: WASTE
pl: ODPADY
uk: ВІДХОДИ

source: Enter waste name
pl: Wpisz nazwę odpadu
uk: Введіть назву відходів

source: Searching...
pl: Wyszukiwanie...
uk: Пошук...

# noResultsFor
source: No waste starting with "{query}"
pl: Brak odpadów zaczynających się na "{query}"
uk: Немає відходів, що починаються з "{query}"

source: Where to throw:
pl: Gdzie wyrzucić:
uk: Куди викинути:

source: or:
pl: lub:
uk: або:

source: Waste group:
pl: Grupa odpadów:
uk: Група відходів:

source: Search again
pl: Wyszukaj ponownie
uk: Шукати знову

source: Check where to throw
pl: Sprawdź gdzie wyrzucić
uk: Перевірте, куди викинути

# minThreeCharacters
source: Enter at least 3 characters to search for waste
pl: Wpisz co najmniej 3 znaki, aby wyszukać odpady
uk: Введіть принаймні 3 символи для пошуку відходів

source: HOW TO SEGREGATE?
pl: JAK SEGREGOWAĆ?
uk: ЯК СОРТУВАТИ?

source: Segregation guide
pl: Przewodnik segregacji
uk: Посібник із сортування

source: Instructions
pl: Instrukcje
uk: Інструкції

source: What can be thrown
pl: Co można wyrzucić
uk: Що можна викинути

source: What cannot be thrown
pl: Czego nie można wyrzucić
uk: Що не можна викинути

source: Preparation
pl: Przygotowanie
uk: Підготовка

source: Notes
pl: Uwagi
uk: Примітки

source: Attention:
pl: Uwaga:
uk: Увага:

source: Do not throw:
pl: Nie wrzucaj:
uk: Не викидайте:

source: Mixed
pl: Zmieszane
uk: Змішані

source: Paper
pl: Papier
uk: Папір

source: Glass
pl: Szkło
uk: Скло

# plastic
source: Metals and Plastics
pl: Metale i tworzywa sztuczne
uk: Метали та пластик

source: Bio
uk: Біо

source: Ash
pl: Popiół
uk: Попіл

source: Bulky
pl: Gabaryty
uk: Габаритні

# green
source: Green waste
pl: Odpady zielone
uk: Зелені відходи

source: • Newspapers and magazines
pl: • Gazety i czasopisma
uk: • Газети та журнали

source: • Cardboard and paperboard
pl: • Kartony i tektury
uk: • Картон

source: • Office paper
pl: • Papier biurowy
uk: • Офісний папір

source: • Books (without covers)
pl: • Książki (bez okładek)
uk: • Книги (без обкладинок)

source: • Dirty paper
pl: • Papieru zabrudzonego
uk: • Забрудненого паперу

source: • Wallpaper
pl: • Tapet
uk: • Шпалер

source: • Waxed paper
pl: • Papieru woskowanego
uk: • Вощеного паперу

source: • Glass bottles
pl: • Butelki szklane
uk: • Скляні пляшки

source: • Glass jars
pl: • Słoiki szklane
uk: • Скляні банки

source: • Glass packaging
pl: • Opakowania szklane
uk: • Скляна упаковка

source: • Window glass
pl: • Szkła okiennego
uk: • Віконного скла

source: • Mirrors
pl: • Luster
uk: • Дзеркал

source: • Porcelain
pl: • Porcelany
uk: • Порцеляни

source: • Aluminum cans
pl: • Puszki aluminiowe
uk: • Алюмінієві банки

source: • Steel cans
pl: • Puszki stalowe
uk: • Сталеві банки

source: • Plastic packaging
pl: • Opakowania z tworzyw sztucznych
uk: • Пластикова упаковка

source: • Drink cartons
pl: • Kartony po napojach
uk: • Картонні пакети з напоями

source: • Batteries
pl: • Baterii
uk: • Батарейок

source: • Electronics
pl: • Elektroniki
uk: • Електроніки

source: • Food scraps
pl: • Resztki jedzenia
uk: • Харчові залишки

source: • Egg shells
pl: • Skorupki jaj
uk: • Яєчна шкаралупа

source: • Coffee and tea grounds
pl: • Fusy kawy i herbaty
uk: • Кавова та чайна гуща

source: • Vegetable and fruit peels
pl: • Obierki warzyw i owoców
uk: • Очистки овочів та фруктів

source: • Meat and fish
pl: • Mięsa i ryb
uk: • М'яса та риби

source: • Bones
pl: • Kości
uk: • Кісток

source: • Oil
pl: • Oleju
uk: • Олії

source: • Furnace ash
pl: • Popiół z pieców
uk: • Попіл із печей

source: • Fireplace ash
pl: • Popiół z kominków
uk: • Попіл із камінів

source: • Slag
pl: • Żużel
uk: • Шлак

source: • Cigarette ash
pl: • Popiołu z papierosów
uk: • Попіл від сигарет

source: • Other waste
pl: • Innych odpadów
uk: • Інших відходів

source: • Furniture
pl: • Meble
uk: • Меблі

source: • Appliances
pl: • Sprzęt AGD
uk: • Побутова техніка

source: • Bicycles
pl: • Rowery
uk: • Велосипеди

source: • Mattresses
pl: • Materace
uk: • Матраци

source: • Call for collection
pl: • Zgłoś odbiór telefonicznie
uk: • Замовте вивезення телефоном

# placeInFront
source: • Place in front of property
pl: • Ustaw przed posesją
uk: • Виставте перед будинком

source: • Grass clippings
pl: • Skoszona trawa
uk: • Скошена трава

source: • Leaves
pl: • Liście
uk: • Листя

source: • Branches
pl: • Gałęzie
uk: • Гілки

source: • Hedge trimmings
pl: • Przycięte żywopłoty
uk: • Обрізані живоплоти

source: • Plant waste
pl: • Odpady roślinne
uk: • Рослинні відходи

# doNotThrowGreen
source: • Do not throw:
pl: • Nie wrzucaj:
uk: • Не викидайте:

source: • Soil and stones
pl: • Ziemia i kamienie
uk: • Земля та каміння

source: • Food waste
pl: • Odpady spożywcze
uk: • Харчові відходи

# nonRecyclableWaste
source: • Waste that cannot be recycled
pl: • Odpady, które nie nadają się do segregacji
uk: • Відходи, що не підлягають переробці

source: • Dirty packaging
pl: • Zabrudzone opakowania
uk: • Забруднена упаковка

source: • Hygienic waste
pl: • Odpady higieniczne
uk: • Гігієнічні відходи

source: • Hazardous waste
pl: • Odpadów niebezpiecznych
uk: • Небезпечних відходів

source: Reminder
pl: Przypomnienie
uk: Нагадування

source: Notification time
pl: Godzina powiadomień
uk: Час сповіщень

source: Location access
pl: Dostęp do lokalizacji
uk: Доступ до локації

source: Language
pl: Język
uk: Мова

source: App version
pl: Wersja aplikacji
uk: Версія додатку

source: Test notifications
pl: Test powiadomień
uk: Тест сповіщень

source: Test
uk: Тест

source: Check
pl: Sprawdź
uk: Перевірити

source: Scheduled notifications
pl: Zaplanowane powiadomienia
uk: Заплановані сповіщення

source: Test notification sent
pl: Wysłano testowe powiadomienie
uk: Тестове сповіщення надіслано

source: Enabled
pl: Włączone
uk: Увімкнено

source: Disabled
pl: Wyłączone
uk: Вимкнено

source: Polish
pl: Polski
uk: Польська

source: English
pl: Angielski
uk: Англійська

source: Waste reminder
pl: Przypomnienie o odpadach
uk: Нагадування про відходи

# checkWasteScheduleToday
source: Check today's waste collection schedule
pl: Sprawdź harmonogram odbioru odpadów na dzisiaj
uk: Перевірте розклад вивезення відходів на сьогодні

source: Permissions required
pl: Uprawnienia wymagane
uk: Потрібні дозволи

# permissionMessage
source: To use this feature, you must grant permissions to {permissionType} in app settings.
pl: Aby korzystać z tej funkcji, musisz udzielić uprawnień do {permissionType} w ustawieniach aplikacji.
uk: Щоб використовувати цю функцію, потрібно надати дозволи на {permissionType} в налаштуваннях додатку.

source: Open settings
pl: Otwórz ustawienia
uk: Відкрити налаштування

source: Monday
pl: Poniedziałek
uk: Понеділок

source: Tuesday
pl: Wtorek
uk: Вівторок

source: Wednesday
pl: Środa
uk: Середа

source: Thursday
pl: Czwartek
uk: Четвер

source: Friday
pl: Piątek
uk: П'ятниця

source: Saturday
pl: Sobota
uk: Субота

source: Sunday
pl: Niedziela
uk: Неділя

source: January
pl: Styczeń
uk: Січень

source: February
pl: Luty
uk: Лютий

source: March
pl: Marzec
uk: Березень

source: April
pl: Kwiecień
uk: Квітень

source: May
pl: Maj
uk: Травень

source: June
pl: Czerwiec
uk: Червень

source: July
pl: Lipiec
uk: Липень

source: August
pl: Sierpień
uk: Серпень

source: September
pl: Wrzesień
uk: Вересень

source: October
pl: Październik
uk: Жовтень

source: November
pl: Listopad
uk: Листопад

source: December
pl: Grudzień
uk: Грудень

# noInternetConnection
source: No internet connection. Check your connection and try again.
pl: Brak połączenia z internetem. Sprawdź połączenie i spróbuj ponownie.
uk: Немає підключення до інтернету. Перевірте підключення та спробуйте знову.

# serverError
source: Server error. Please try again later.
pl: Błąd serwera. Spróbuj ponownie później.
uk: Помилка сервера. Спробуйте пізніше.

# unknownError
source: Unexpected error
pl: Nieoczekiwany błąd
uk: Неочікувана помилка

# loadingError
source: Error loading data
pl: Błąd ładowania danych
uk: Помилка завантаження даних

# tryAgainLater
source: Please try again later
pl: Spróbuj ponownie później
uk: Спробуйте пізніше

# timeoutError
source: Request timeout. Check your internet connection.
pl: Przekroczono czas oczekiwania. Sprawdź połączenie internetowe.
uk: Перевищено час очікування. Перевірте інтернет-з'єднання.

# requestCancelled
source: Request was cancelled.
pl: Żądanie zostało anulowane.
uk: Запит було скасовано.

# scheduleNotFound
source: Schedule not found for this address.
pl: Nie znaleziono harmonogramu dla tego adresu.
uk: Не знайдено розклад для цієї адреси.

# fieldCannotBeEmpty
source: {fieldName} cannot be empty
pl: {fieldName} nie może być pusty
uk: {fieldName} не може бути порожнім

# fieldTooLong
source: {fieldName} is too long (max {maxLength} characters)
pl: {fieldName} jest zbyt długi (max {maxLength} znaków)
uk: {fieldName} занадто довгий (макс. {maxLength} символів)

source: Error loading schedule
pl: Błąd pobierania harmonogramu
uk: Помилка завантаження розкладу

source: Error loading sectors
pl: Błąd pobierania sektorów
uk: Помилка завантаження секторів

source: Error loading streets
pl: Błąd pobierania ulic
uk: Помилка завантаження вулиць

source: Error loading properties
pl: Błąd pobierania posesji
uk: Помилка завантаження нерухомості

source: Error loading details
pl: Błąd pobierania szczegółów
uk: Помилка завантаження деталей

source: Error searching waste
pl: Błąd wyszukiwania odpadów
uk: Помилка пошуку відходів

source: Server error: {code}
pl: Błąd serwera: {code}
uk: Помилка сервера: {code}

# scheduleTooltip
source: Schedule
pl: Harmonogram
uk: Розклад

# knowledgeBaseTooltip
source: Knowledge Base
pl: Baza wiedzy
uk: База знань

# shopTooltip
source: KOMA Shop
pl: Sklep KOMA
uk: Магазин KOMA

# bokTooltip
source: BOK Portal
uk: BOK Портал

# notificationsTooltip
source: Notifications
pl: Powiadomienia
uk: Сповіщення

# settingsTooltip
source: Settings
pl: Ustawienia
uk: Налаштування

source: Disposal locations
pl: Lokalizacje utylizacji
uk: Пункти утилізації

# searchLocationPlaceholder
source: Search location...
pl: Wyszukaj lokalizację...
uk: Пошук локації...

source: All
pl: Wszystkie
uk: Усі

# loadingLocationsError
source: Error loading locations
pl: Błąd ładowania lokalizacji
uk: Помилка завантаження локацій

source: No locations
pl: Brak lokalizacji
uk: Немає локацій

# noLocationsForFilters
source: No locations found for selected filters
pl: Nie znaleziono lokalizacji dla wybranych kryteriów
uk: Не знайдено локацій за обраними фільтрами

source: Map
pl: Mapa
uk: Карта

source: Call
pl: Zadzwoń
uk: Зателефонувати

source: Delete
pl: Usuń
uk: Видалити

source: Address changed to
pl: Zmieniono adres na
uk: Адресу змінено на

source: External links
pl: Linki zewnętrzne
uk: Зовнішні посилання

# pageNotFound
source: Page not found: {routeName}
pl: Nie znaleziono strony: {routeName}
uk: Не знайдено сторінку: {routeName}

source: Return to main
pl: Powrót do głównej
uk: Повернутися на головну

# appSubtitle
source: Waste Management
pl: Zarządzanie odpadami
uk: Управління відходами
